In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "name": ["A", "B", "C"],
    "Math" : [90, 86, 89],
    "Science" : [67, 78, 90]
}

df = pd.DataFrame(data)

df

  name  Math  Science
0    A    90       67
1    B    86       78
2    C    89       90

In [3]:
# Select column
df["Math"]

0    90
1    86
2    89
Name: Math, dtype: int64

In [4]:
# select multiple columns
df[["Math", "Science"]]

   Math  Science
0    90       67
1    86       78
2    89       90

In [5]:
df.columns

Index(['name', 'Math', 'Science'], dtype='object')

In [6]:
data = {
    "name": ["A", "B", "C"],
    "Age" : [20,30,40],
    "City" : ["Rajkot", "Surat", "Jaipur"]
}

df = pd.DataFrame(data)
print(df)

  name  Age    City
0    A   20  Rajkot
1    B   30   Surat
2    C   40  Jaipur

In [7]:
# select specific row
df.loc[0]
# df.loc[0:1]

name         A
Age         20
City    Rajkot
Name: 0, dtype: object

In [8]:
df.iloc[0]
df.iloc[0:2]

  name  Age    City
0    A   20  Rajkot
1    B   30   Surat

In [9]:
data = {
    "name": ["A", "B", "C", "D", "E"],
    "marks": [97, 68, 89, 78, 90]
}

df = pd.DataFrame(data)

df

  name  marks
0    A     97
1    B     68
2    C     89
3    D     78
4    E     90

In [10]:
# print(df[df["marks"] > 80])
# print(df[df["name"] == "A"])
# df["grade"] = ["AA", "DD", "BB", "CC", "AA"]

df["Passed"] = df["marks"] > 80

df

  name  marks  Passed
0    A     97    True
1    B     68   False
2    C     89    True
3    D     78   False
4    E     90    True

In [11]:
df.sort_values(by="marks", ascending=False)

  name  marks  Passed
0    A     97    True
4    E     90    True
2    C     89    True
3    D     78   False
1    B     68   False

In [12]:
# df = df.set_index("grade")
df = df.reset_index()
df

   index name  marks  Passed
0      0    A     97    True
1      1    B     68   False
2      2    C     89    True
3      3    D     78   False
4      4    E     90    True

In [13]:
data = {
    "name": ["Bob", "Aman", "Jay", "Raj", "Nayan", "Neha", "Bob"],
    "marks" : [89, 78, None, 92, 75, np.nan, 89],
    "attendance":  [95, 88, 56, None, 78, np.nan, 95]
}

df = pd.DataFrame(data)
df

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay    NaN        56.0
3    Raj   92.0         NaN
4  Nayan   75.0        78.0
5   Neha    NaN         NaN
6    Bob   89.0        95.0

In [20]:
# df.isnull()
# df.isnull().sum()
# df.notnull()
# df.dropna()
# df["marks"].apply(lambda x:x + 5)

0    94.0
1    83.0
2    89.6
3    97.0
4    80.0
5    89.6
6    94.0
Name: marks, dtype: float64

In [15]:
df["marks"] = df["marks"].fillna(df["marks"].mean())
df["attendance"] = df["attendance"].fillna(100)
df

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay   84.6        56.0
3    Raj   92.0       100.0
4  Nayan   75.0        78.0
5   Neha   84.6       100.0
6    Bob   89.0        95.0

In [16]:
df.drop_duplicates()

    name  marks  attendance
0    Bob   89.0        95.0
1   Aman   78.0        88.0
2    Jay   84.6        56.0
3    Raj   92.0       100.0
4  Nayan   75.0        78.0
5   Neha   84.6       100.0

In [17]:
df["name"].value_counts()

name
Bob      2
Aman     1
Jay      1
Raj      1
Nayan    1
Neha     1
Name: count, dtype: int64

In [23]:
data = {
    "name": ["A", "B", "C", "D", "E", "F"],
    "marks": [97, 68, 89, 78, 90, 58]
}

df = pd.DataFrame(data)
df

  name  marks
0    A     97
1    B     68
2    C     89
3    D     78
4    E     90
5    F     58

In [24]:
def get_grade(mark):
    if mark >= 90:
        return "AA"
    elif mark >= 80:
        return "BB"
    else:
        return "CC"

df["grade"] = df["marks"].map(get_grade)
df

  name  marks grade
0    A     97    AA
1    B     68    CC
2    C     89    BB
3    D     78    CC
4    E     90    AA
5    F     58    CC

In [26]:
data = {
    "name":["Brijesh", "Jay", "Nayan", "Jeel", "Tej"],
    "class": ["A", "B", "B", "A", "A"],
    "marks": [85, 90, 95, 70, 88]
}

df = pd.DataFrame(data)
df

      name class  marks
0  Brijesh     A     85
1      Jay     B     90
2    Nayan     B     95
3     Jeel     A     70
4      Tej     A     88

In [33]:
group_by_class = df.groupby("class")
# group_by_class["marks"].mean()
# group_by_class["marks"].sum()agg(["mean", "max", "min"])
# group_by_class.get_group("B")
group_by_class["marks"].sum()

class
A    243
B    185
Name: marks, dtype: int64

In [39]:
df1 = pd.DataFrame([1,2,3,4,5])
df2 = pd.DataFrame([11,22,33,44,55])

# pd.concat([df1, df2], axis=0) # default row-wise join
pd.concat([df1, df2], axis=1) # default col-wise join

   0   0
0  1  11
1  2  22
2  3  33
3  4  44
4  5  55

In [46]:
students = pd.DataFrame({
    "StudentID": [1,2,3],
    "Name": ["Brijesh", "Jay", "Raj"]
})

classes = pd.DataFrame({
    "StudentID": [1,2, 4],
    "Class": ["A", "B", "C"]
})

# merged = pd.merge(students, classes, on="StudentID", how="inner")
# merged = pd.merge(students, classes, on="StudentID", how="left")
# merged = pd.merge(students, classes, on="StudentID", how="right")
merged = pd.merge(students, classes, on="StudentID", how="outer")
merged

   StudentID     Name Class
0          1  Brijesh     A
1          2      Jay     B
2          3      Raj   NaN
3          4      NaN     C

In [49]:
df1 = pd.DataFrame({"Marks":[89,76]}, index=["Alice", "Bob"]);
df2 = pd.DataFrame({"age":[21,22]}, index=["Alice", "Bob"]);

res = df1.join(df2)
res

       Marks   age
Alice     89  21.0
Bob       76   NaN